Revit 2026 API

# AreaBasedLoadDataConnectToUpstreamNode Method

---

Connects to an upstream electrical analytical node.

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void ConnectToUpstreamNode(
	ElementId upstreamNodeId
)
```
```vb
Public Sub ConnectToUpstreamNode (
	upstreamNodeId As ElementId
)
```
```cpp
public:
void ConnectToUpstreamNode(
	ElementId^ upstreamNodeId
)
```
```fsharp
member ConnectToUpstreamNode :
        upstreamNodeId : ElementId -> unit
```

#### Parameters

upstreamNodeId ElementId
     The upstream electrical analytical node id.

| Exception | Condition |
| --- | --- |
| ArgumentException | The id is not an electrical analytical node id. -or- The area based load can not connect to the upstream electrical analytical node. |
| ArgumentNullException | A non-optional argument was null |

If the area based load supplies from Node A, Node A is the upstream node of the area based load, and the area based load is the downstream node of node A.

#### Reference

AreaBasedLoadData Class

Autodesk.Revit.DB.Electrical Namespace